OpenFoam-Solitary/demo.ee=0.30.new/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

JJ{
    
    xmin    0;
    xmax    50;
    
    ymin    -0.01;
    ymax     0.01;

    zmin    -0.5;
    zmax     0.5;

    Lx    #calc    "${xmax} - ${xmin}";
    Ly    #calc    "${ymax} - ${ymin}";
    Lz    #calc    "${zmax} - ${zmin}";

    dx    0.05;
    dy    0.01;
    dz    0.05;

    Nx    #calc    "ceil(${Lx}/${dx})";
    Ny    #calc    "ceil(${Ly}/${dy})";
    Ny    1;
    Nz    #calc    "ceil(${Lz}/${dz})";
}

vertices
(
    ( ${JJ.xmin} ${JJ.ymin} ${JJ.zmin} )
    ( ${JJ.xmax} ${JJ.ymin} ${JJ.zmin} )
    ( ${JJ.xmax} ${JJ.ymax} ${JJ.zmin} )
    ( ${JJ.xmin} ${JJ.ymax} ${JJ.zmin} )
    ( ${JJ.xmin} ${JJ.ymin} ${JJ.zmax} )
    ( ${JJ.xmax} ${JJ.ymin} ${JJ.zmax} )
    ( ${JJ.xmax} ${JJ.ymax} ${JJ.zmax} )
    ( ${JJ.xmin} ${JJ.ymax} ${JJ.zmax} )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (${JJ.Nx} 1 ${JJ.Nz}) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
