OpenFoam-Solitary/demo.ee=0.30.new/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       38980;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       39000;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       39020;
    }
    top
    {
        type            patch;
        nFaces          1000;
        startFace       40020;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40000;
        startFace       41020;
    }
)

// ************************************************************************* //
